{
  "presentations": [
    {
      "title": "From Here to There: Where Will Diversity Take Us",
      "aurthor": "Dr. Terry Whitt Bailey (Director of Community Development for the City of Muncie, Indiana)",
      "synopsis": "A synopsis is not available."
    },

    {
      "title": "Addressing Special Education Disproportionality Through Culturally Responsive Practices",
      "aurthor": "Leah Nellis (School Psychology), and Myeshia Smith (School Psychology)",
      "synopsis": "Explanations for the current disproportional representation of students from historically underserved racial and ethnic groups as well as English learners in special education will be explored through a review of research and discussion of implications for training and preparation of educators, future research, and practice changes.  The tenets of culturally responsive practices will be applied to the special education evaluation process to demonstrate how such an approach can be used to change school practices to support fair, valid, and appropriate assessment of linguistically and culturally diverse K-12 students.  "
    },

    {
      "title": "Race, Religion and Multiracial Congregations in America: Do Multiracial Congregations address Dr. King’s observations of Persistent Racial Segregation?",
      "aurthor": "Dan Royer (Adult, Higher, and Community Education) and Ruby Cain (Adult, and Community Education)",
      "synopsis": "Reflection on the statement by Dr. Martin Luther King, Jr. that Sunday morning at eleven o’clock is the most segregated hour in America resulted in an analysis of multiracial congregations.  Findings included a continuum of realities from multi-racial/majority culture to multi-racial/multi-cultures."
    },

    {
      "title": "Rethinking Children's Literature: Reading and Writing for Change",
      "aurthor": "Darolyn \\\"Lyn\\\" Jones (English and Education, Elementary Education), Hilary Chan (Elementary Education) and Joanna Ziarko (Elementary Education)",
      "synopsis": "Diversity in children’s literature is critical in constructing culture and community identity. We grow up and are conditioned and ultimately wired and re-wired by the stories we read as children and retell as adults."
    },

    {
    "title": "Including LGBTQ Voice:  A Narrative of Two Music Teachers",
    "author": "Karin S. Hendricks (Music Education)",
    "synopsis": "This narrative reveals how two gay music teachers in one Midwestern state have successfully dealt with discriminatory challenges to their career. Our story within a story illustrates a process of mentorship, in which the younger teacher shared and re-shared details of a traumatic past experience with an older colleague who helped him find new and empowering ways in which to view his past experience."
    },

    {
    "title": "Diversity Playlists: Using Music to Elicit Student Awareness of Privilege and Oppression",
    "author": "Karin S. Hendricks (Music Education)",
    "synopsis": "This teacher research explores curricular possibilities for using music playlists as a tool for recognizing privilege and oppression within existing social systems, and as a self-reflective mirror for eliciting student awareness of their own biases, assumptions, and prejudices. This study also illustrates one teacher’s journey toward deeper self-awareness as a result of interacting and sharing music with students of diverse backgrounds."
    },

    {
    "title": "Gay or Straight: Does Instructor’s Sexual Orientation Matter to Students?",
    "author": "Alina V. Katrevich (Social and Behavioral Sciences), Mara S. Aruguete (Social and Behavioral Sciences), Kurt D. DeBord (Social and Behavioral Sciences)",
    "synopsis": "Our research investigates students’ reactions to learning that their instructor is gay. Compared to a straight-instruct or control group, students whose gay instructor revealed his sexual orientation showed a significant reduction in homophobic attitude."
    },

    {
    "title": "The More the Obstacles Fall Between Us: Cultivating Inclusive Community-- An Interactive Performance of the Welcome Project",
    "author": "Allison Schuette (English/Creative Writing), Liz Wuerffel (Art), Samuel Payan (Office of Multicultural Programs), NaTasha Henry (Admissions)",
    "synopsis": "In an increasingly diverse world, what does it take to foster inclusion and live well together? Come explore the central themes we’ve encountered while collecting stories and facilitating conversations through this interactive performance which provides a feel for the methods of the Welcome Project, an appreciation for the complexity of living together in increasingly diverse communities, and a context for ongoing  conversations with neighbors."
    },

    {
    "title": "Teaching the Teachers: A Model Faculty Development Seminar Regarding Inclusive Pedagogy",
    "author": "David W. Concepción (Philosophy)",
    "synopsis": "Distinguishing (i) inclusive pedagogy and course design from (ii) diversity in course content, this session illuminates teaching strategies that should increase student excellence regardless of academic subject. Session participants will receive a copy of a faculty development seminar syllabus, discuss concepts in both diversity and learning theory that are central to the seminar, and be guided as they reflect on how to increase the inclusivity of their own teaching practice."
    },


    {
    "title": "Beyond Boundaries: Experiences of Immigrants with Diverse Sexualities",
    "author": "Betsy Jose (Gender Studies)",
    "synopsis": "When queer individuals build lives in a country far from their own, not only are they looked upon as “different” due to their race, nationality, religion, and other factors, but having a \"different\" sexual orientation further complicates life. The author’s debut documentary film – “Beyond Boundaries: Experiences of Immigrants with Diverse Sexualities” – takes a closer look at some of these stories."
    },

    {
      "title": "Student Teaching Abroad: A Journey to Cultural Sensitivity",
      "author": "Opal Lee Bartzis(Adult, Higher, and Community Education)",
      "synopsis": "The results of qualitative research that examined the development of cultural sensitivity in U.S. education majors who completed student teaching placements in Northern Ireland are presented. Given the increasingly diverse U.S. classroom, the importance of expanding teacher education programs to include cross-cultural experiences is clear."
    },

    {
    "title": "Addressing Language and Communication Stereotypes in the College Classroom",
    "author": "Elizabeth M. Riddle (Linguistics)",
    "synopsis": "This presentation shows how sociolinguistic and cross-cultural communication research can be translated into action against prejudice. Pertinent research is reviewed and three original activities developed for an undergraduate course, Language and Society, are shared."
    },

    {
    "title": "Literature In the Math Classroom: A feminist approach to middle school math education",
    "author": "Kara Bungard (Education)",
    "synopsis": "Due to the widely recognized gender gap in STEM subjects, a middle school mathematics teacher attempted to create a feminist classroom in order to support students who might otherwise be marginalized due to gendered ways of knowing. This study looks at how utilizing literature in the mathematics classroom helped move students from silence to constructed knowledge."
    },

    {
    "title": "The Perils of Underrepresentation in Computing",
    "author": "Dr. Manuel A. Pérez-Quiñones (Computer Science)",
    "synopsis": "A synopsis is not available."
    },

    {
    "title": "\"Except that the haunted, hidden thing was me\": Using Critical Sociological Theories of Haunting in Paradigms for Transsexual Justice.",
    "author": "Esther Wolfe (Literature & Post-Colonial Study).",
    "synopsis": "This presentation will explore intersections of transsexuality and critical sociological theory on cultural haunting. The presentation uses critical sociological theory of haunting to illustrate the ways in which transsexuality is rendered ghostly, and how this ghostliness is both an oppressive tactic of state violence and a potential paradigm for structuring intervention and transformative justice for transsexual people."
    },

    {
    "title": "Photovoice as Methodology and Pedagogy: Reflections from a Graduate-Level Course Focused on Community Colleges and Diversity",
    "author": "Amanda O. Latz (Education), Robin Phelps-Ward (Adult, Higher, and Community Education), Dan W. Royer (Adult, Higher, and Community Education), Abigail R. Vannatta (Biology), & Tiffany M. Peters (Adult, Higher, and Community Education)",
    "synopsis": "During the spring 2014 semester, students enrolled in a graduate-level course focused on community colleges and diversity and local community college student-participant-researchers’ partnered to carry out a photovoice project. The session will include narrative accounts from those involved, participant-researchers’ photographs, reflections on the efficacy of the overall process, and practical tips for those interested in facilitating such a project in their own courses and communities."
    },

    {
    "title": "The Freedom Bus: Using Immersive Learning to Pursue Social Justice",
    "author": "Beth A. Messner (Communication Studies)",
    "synopsis": "This presentation uses the Freedom Bus as a case study to illustrate how immersive learning pedagogy can be used to advance social justice projects.  In this project, an interdisciplinary team of students united to transform a retired city bus into a mobile museum that tells the story of the struggle for civil rights in East Central Indiana."
    },

    {
    "title": "Teaching and Learning When Racism is Hidden, In Plain Sight",
    "author": "Ruby Cain (Adult and Community Education), Susan McGrade (English) & Keri Rodgers (Educational Studies)",
    "synopsis": "How can we pierce the shield of the majority culture mindset in the academy to obtain authentic teaching and learning on the complexities of racism and oppression? Experiences will be shared and solicited in an interactive presentation, including exploration of cultural identities, racial autobiographies, affinity groups, and community mobilization."
    },

    {
    "title": "Ethnic Differences in Student Support at an HBCU",
    "author": "Mara Aruguete (Psychology), Kellie Poe (Social and Behavioral Sciences) & Precious Hardy (Social and Behavioral Sciences)",
    "synopsis": "We will introduce an instrument (the Student Support Needs Scale or SSNS) developed to measure student support needs in a college setting.  We then review a study examining similarities and differences in African American and Caucasian student support needs at a Historically Black University."
    }
  ]
}
